app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "artists".* FROM "artists"
---
  def new
=begin
    if params[:artist_id] && !Artist.find_by(id: params[:artist_id])
      @song = Song.new(artist_id: params[:artist_id])
    elsif params[:artist_id] && !Artist.find_by(id: params[:artist_id])
      redirect_to artists_path
    else
      @song = Song.new
    end
=end
    if params[:artist_id] && !Artist.exists?(params[:artist_id])

SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
SELECT  1 AS one FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  1 AS one FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1]]
---
  def edit
    if params[:artist_id]
      @nested = true
      if !Artist.exists?(params[:artist_id])
        redirect_to artists_path
      else
        @artist = Artist.find_by(id: params[:artist_id])
        @song = Song.find_by(id: params[:id])
        redirect_to artist_songs_path(@artist) unless @artist.songs.include?(@song)